{"basics":{"name":"Bálint Batki","label":"Postdoc Researcher @ IFE, Norway","picture":"","email":"","website":"","summary":"I aim to contribute to the safe operation of current and future nuclear reactors by utilizing my experience in reactor physics and thermal-hydraulics while also integrating novel machine learning techniques to improve and extend the present methods in this field.","location":{"address":"","postalCode":"1111","city":"","countryCode":"","region":""},"profiles":[]},"work":[{"company":"Institute for Energy Technology","position":"Postdoctoral Researcher","website":"","startDate":"2024-05-01","summary":"Nuclear simulations using multi-physics and AI tools related to the Norwegian Nuclear Research Center´s activities.","highlights":[]},{"company":"HUN-REN Centre for Energy Research","position":"Researcher","website":"","startDate":"2021-07-01","summary":"Conducting multi-physics research and analyses of VVER and Gen-IV reactors, including -participation in the SafeG Euratom project on the ALLEGRO reactor core design development, -coordinating our code validation projects on the IAEA CRP CEFR Start-up Tests and OECD NEA Rostov-2 boron dilution benchmarks, -performing safety analyses for Paks NPP. Working on practical machine learning applications such as -spent fuel characterization based on gamma spectrometry, which was published at the M&C 2023 conference -involved in the OECD NEA AI&ML Task Force and working on the critical heat flux prediction benchmark. -developing AI algorithms for core loading pattern optimization for Paks NPP. Mentoring Hungarian and international BSc and MSc students concerning the above topics.","highlights":[],"endDate":"2024-04-31"},{"company":"Smart Software Consulting Kft.","position":"Machine Learning Engineer","website":"","startDate":"2021-06-01","summary":"I built and trained recurrent neural network (LSTM) models for water level forecasting of the River Tisza, achieving state-of-the-art predictive performance. This collaboration with the University of Szeged and Water Management Directorate resulted in a research publication.","highlights":[],"endDate":"2023-06-01"},{"company":"OptAI Solutions Kft.","position":"Machine Learning Engineer","website":"","startDate":"2018-09-01","summary":"I developed machine learning and computer vision-based algorithms in Python and C++ for an automated invoice processing system. I gained experience with Google Cloud Platform (GCP) and utilization of cloud-based APIs.","highlights":[],"endDate":"2020-06-01"},{"company":"Centre for Energy Research","position":"PHD Researcher","website":"","startDate":"2016-09-01","summary":"The primary outcome of my PhD thesis was the extension and validation of the KIKO3DMG nodal code for dynamic analyses of fast reactors and multi-physics analysis of an unprotected transient of a gas-cooled fast reactor. It resulted in four peer-reviewed publications and four conference papers.","highlights":[],"endDate":"2021-07-01"},{"company":"Hungarian Academy of Science Centre for Energy Research","position":"Intern","website":"","startDate":"2015-09-01","summary":"I partially conducted my MSc thesis research at MTA EK while I was working on ALLEGRO GFR core neutronics calculations.","highlights":[],"endDate":"2016-08-31"},{"company":"Budapest University of Technology and Economics","position":"Teaching Assistant","website":"","startDate":"2015-01-01","summary":"During my master’s and PhD studies, I taught practical nuclear and neutron physics courses and supervised laboratory measurements such as gamma spectroscopy and neutron flux measurement for engineers and physicists.","highlights":[],"endDate":"2019-06-01"}],"education":[{"institution":"Budapest University of Technology and Economics","area":"","studyType":"PhD","startDate":"2016-09-01","gpa":"","courses":[],"endDate":"2021-09-01"},{"institution":"Budapest University of Technology and Economics","area":"","studyType":"Master’s Degree","startDate":"2014-09-01","gpa":"","courses":[],"endDate":"2016-07-01"},{"institution":"Budapest University of Technology and Economics","area":"","studyType":"Bachelor’s Degree","startDate":"2011-09-01","gpa":"","courses":[],"endDate":"2014-07-01"},{"institution":"Apáczai Csere János Secondary School of Eötvös Loránd University","area":"","studyType":"High School","startDate":"2007-09-01","gpa":"","courses":[],"endDate":"2011-07-01"}],"publications":[{"name":"Application of machine learning methods for spent fuel characterization based on gamma spectrometry measurements","publisher":"Annals of Nuclear Energy","releaseDate":"2024-05-03","website":"https://doi.org/10.1016/j.anucene.2024.110601","summary":"We have developed cutting-edge machine learning models to predict key properties of spent nuclear fuel assemblies, including burnup, cooling time, initial enrichment, and Pu-239 content. Here's a glimpse into our approach:  🔍 Data Processing: Measured gamma spectra are analyzed, and activity ratios of fission products are calculated to serve as input features.  🤖 Models Deployed: Support Vector Regression, Random Forest, and Multi-Layer Perceptron models are used, considering data uncertainty during inference to produce prediction intervals. Input features are ranked using the Gini importance from Random Forest models.  🌟 Deep Learning Innovation: A Convolutional Neural Network (CNN) model has been developed to predict spent fuel parameters directly from the measured spectra.  💡 Results: These new models significantly outperform previous methods, which relied on nonlinear regression using a single feature. Our approach not only improves the precision of burnup and cooling time predictions but also accurately estimates initial enrichment and Pu-239 content."},{"name":"Water level prediction using long short-term memory neural network model for a lowland river: a case study on the Tisza River, Central Europe","publisher":"Environmental Sciences Europe","releaseDate":"2023-11-04","website":"https://doi.org/10.1186/s12302-023-00796-3","summary":"State-of-the-art results in river water level prediction! 🌊 Our latest research in Hungary challenges traditional methods with cutting-edge machine learning. 🚀 After rigorous testing, the Long Short-Term Memory (LSTM) model outperformed the conventional Discrete Linear Cascade Model (DLCM) across all time horizons, delivering more accurate 7-day forecasts. 📈 Despite slight underestimations, LSTM's encoder-decoder architecture achieved 68.5–76.1% precision within required intervals, particularly excelling in low and flood stages. 🌐 Our findings suggest LSTM's effectiveness in addressing climate-driven hydrological changes, urging further exploration in similar conditions."},{"name":"Validation of the KIKO3DMG neutronics code on the CEFR start-up tests","publisher":"Annals of Nuclear Energy","releaseDate":"2022-10-17","website":"https://www.sciencedirect.com/science/article/pii/S0306454922005230","summary":"This paper presents the first validation of the KIKO3DMG reactor physics code to experimental measurements of a fast reactor. The work was conducted in the frame of an IAEA Coordinated Research Project about the China Experimental Fast Reactor Start-up Tests."},{"name":"Simulation of an unprotected transient of the ALLEGRO reactor using the coupled neutronics/thermal-hydraulics system code KIKO3DMG/ATHLET3.0","publisher":"Annals of Nuclear Energy","releaseDate":"2021-01-01","website":"https://authors.elsevier.com/sd/article/S0306454920307829","summary":"It is the first-ever analysis of an unprotected control rod withdrawal transient of the ALLEGRO using a coupled neutronics/thermal-hydraulics code, namely the KIKO3DMG/ATHLET. It is revealed that the KIKO3DMG/ATHLET provides good results by using 6-group constants instead of the widely used 24-group constants, and with this, the computation time of the transient is reduced by 95%. By comparative analysis, it is found that the point-kinetics approach underestimates the assembly-wise peak temperatures nearby the withdrawn control assembly during the investigated transient due to the fixed power distribution and the lack of spatial reactivity effects."},{"name":"Extension and application of the KIKO3DMG nodal code for fast reactor core analyses","publisher":"Annals of Nuclear Energy","releaseDate":"2020-01-09","website":"https://doi.org/10.1016/j.anucene.2019.107295","summary":"A new methodology for modeling the non-uniform axial thermal expansion of fuel with the KIKO3DMG is developed by introducing small mixed nodes. The new model is verified on the ALLEGRO reactor by comparison with Serpent Monte Carlo calculations. It is shown that, in the introduced small mixed nodes, volume-weighted group constants provide correct results, although it is essential to weight the inverse of the diffusion coefficients instead of the diffusion coefficients. It is derived that the inverse volume-weighted diffusion coefficient aims to keep the neutron current at the interface of the merged regions."},{"name":"Application of discontinuity factors and group constants generated by SERPENT in the KIKO3DMG code","publisher":"Kerntechnik","releaseDate":"2018-08-01","website":"https://doi.org/10.3139/124.110911","summary":""},{"name":"Calculation of core safety parameters and uncertainty analyses during unprotected transients for the ALLEGRO and a sodium-cooled fast reactor","publisher":"Annals of Nuclear Energy","releaseDate":"2018-04-01","website":"https://www.sciencedirect.com/science/article/pii/S0306454918302056","summary":"This paper presents the first-ever best estimate plus uncertainty (BEPU) analyses of an unprotected transient overpower (UTOP) and an unprotected loss of flow transient (ULOF) of the ALLEGRO core. The uncertainties of the most important selected core safety parameters originated from possible user effects, modeling uncertainties, and nuclear data uncertainties are taken into account. The ATHLET code with point-kinetics methodology is used. It is found that the peak cladding temperature is sensitive to all the selected uncertain core safety parameters during the ULOF transient. During the UTOP transient, the Doppler and the fuel thermal expansion reactivity coefficients are the dominant factors. It is shown that the peak cladding temperature reaches unacceptable levels during the UTOP transient initiated by a potential 1$ reactivity insertion, which adumbrates that additional safety shutdown systems are to be applied to mitigate the consequences of reactivity transients."}],"skills":[{"name":"Machine Learning","level":"","keywords":["PyTorch","Tensorflow","Time Series Forecasting"]},{"name":"Nuclear Engineering","level":"PhD","keywords":["Reactor Physics","Monte Carlo Simulation","Nuclear Safety","Thermal-hydraulics"]},{"name":"Physics","level":"","keywords":["Research"]},{"name":"Programming","level":"","keywords":["Python, C++"]}],"languages":[{"language":"English","fluency":"Professional working proficiency"},{"language":"Hungarian","fluency":"Native or bilingual proficiency"},{"language":"Russian","fluency":"Elementary proficiency"}]}